"""
正则表达式语法速记
"""
import re
# ========= 基础匹配符号 =========
# 普通字符：字母、数字、汉字，匹配自己
# .      匹配任意1个字符(除换行\n)
# \d     匹配数字 0‑9
# \D     匹配非数字
# \w     匹配单词字符 a‑z A‑Z 0‑9 _ 汉字
# \W     匹配非单词字符

# [aeiou]   匹配括号内任意一个字符
# [^aeiou]  取反，匹配不在括号里的字符
# [0‑5]     表示字符范围

# ========= 数量修饰符（控制前面的内容出现多少次） =========
# *       任意次：0次 或 无数次
# +       至少1次：1次 或 无数次
# ?       至多1次：0次 或 1次
# {m}     严格出现 m次
# {m,}    至少 m次
# {m,n}   出现 m ~ n次

# ========= 其他符号 =========
# |       或，匹配左右任意一个
# ()      分组，括号内当成一个整体
# ^       匹配字符串【开头】
# $       匹配字符串【结尾】


# 🌰手机号示例87555555555555555555555
# r"1[3‑9]\d{9}"       文本中提取手机号
# r"^1[3‑9]\d{9}$"     完整校验整个字符串是不是手机号（^开头 $结尾）

s1 = "12345687啊巴巴阿巴巴手机号是1881234567,18889898232,155123456, QQ号分别是123042411和1551231312,邮箱是Python212@163.com"
print(re.findall(r"188\d{6,8}",s1 ))
print(re.findall(r"155\d{7}",s1 ))
print(re.findall(r"155.*",s1 ))
print(re.findall(r"188.?",s1 )) # + :一个以上

print(re.findall(r"1[58]\d{6,9}.*",s1 ))
print(re.findall(r"^1[1-8]\d{6,9}",s1 )) # ^1匹配开头(一句话开头) $匹配结尾
print(re.findall(r"1[^58]\d{6,9}",s1 )) #[^58]匹配非5或8

print(re.findall(r"\w+@\w+.\w+",s1 )) # 匹配任何单词字符,字母数字
print(re.findall(r"\w+@\w+.\w+",s1, re.ASCII)) # 匹配任何单词字符,字母数字 re.ASCII没有中文

s2 = "现在时间是2026-08-09:19:05:23,今天天气不好,白海豚暴雨"
print(re.findall(r"\d{4}-\d{2}-\d{2}",s2 ))
print(re.findall(r"(\d{4})-(\d{2})-(\d{2})",s2 ))


