# # 算数运算符(-+*/)    赋值运算符(a=1)     比较运算符(=><)     逻辑运算符(and or)
# # 算术运算符 //:整除   %:取模,求余数       **幂函数
# print("14 // 4 =", 14 // 4 )
# print("17 % 3 = ", 17 % 3 )
print("10 ** 3 = ", 10 ** 3)
print("10 ^ 2 = ", 10 ^ 2) # 10二进制:1010（5-0，2-1，1-0，0-1）  2:0010（1-0，1-1，0-0，0-0  ^:异或(位数相比不同为1) 10 ^ 2 = 8
#
# # 输入xy,计算x + y,和x - y 结果输出 # x,y在这都是字符串类型,要转int型 float()浮点数 数和整数
# x = float(input("输入x值:"))
# y = float(input("输入y值:"))
# print("x + y = ", x + y)
# print("x - y = ", x - y)
#
#
# # 赋值运算符 +=  -=  *=  /=(除法运算结果是小数)  %=  //= 整除  **= 符号中间不能加空格,每个都有单独含义
# # num += 2 等效于 num = num + 2        num ** = 2  等效于 num = num ** 2 平方
# num = 85
# num %=10
# print("num %= 10后,num = ", num)
#
# # 比较运算符  ==  !=  >  >=  <  <=  判断对错返回布尔值为结果
# print("100 != 1吗?",100 != 1)
# print("'100'!=100",'100'!='100')
# print("'100'!=100",'100'!=100)
#
# # 逻辑运算符 and  or  not  结果为布尔值输出
# # 键盘输入一个数,判断一个数在10到20间
# num = input("请输入一个数:") # num = int (input("xxxxxxxxxxxx"))
# n = int(num)
# print(f"{n}在10到20之间",n >= 10 and n <= 20)
# input用法：获取用户输入
# # 上同,判断是否不在10到20间
# num = int(input("请输入一个数"))
# print("num不在10到20间",num < 10 or num > 20)