# 大模型部署 (1.本地部署  2.官方开放api  3.云服务平台)游戏机,网吧,游乐园
# 1.本地部署, 安装到自己电脑,或专门买一个服务器部署大模型
# 2.API:Application Programming Interface 应用编程程序接口(两个软件间标准化的桥梁,可以直接调用其功能)
# 3.云服务平台(阿里云百炼,百度千帆,火山引擎)

# Ollama:本地运行,管理llm的工具 (https://ollama.com)

# api开放平台,在一个App里调用一个AI,所以要接入api

# 本地电脑（客户端）---网络通信(ip地址/域名.端口)---deepseek（服务端）
# ip用于定位网络上设备
# ipv4地址:32位二进制       ipv6:128位二进制
# text_box.chat_message("assistant").write(full_response)
"""00100001(132除2的余数)
132.12.86.125 (十进制) 0011 0110101 10111110(不足八位补0)
二进制 (八位二进制可以表示的值的范围为0-255之间)
10000100
00001100
01010110
01111101
"""
# 127.0.0.1:表示本机地址
# localhost:本机域名
# 域名用英文字母和点分隔组成的如(deepseek.com,www.baidu.com) 因为IP地址不好记,英文方便记忆访问
# a:域名-----b:DNS(域名解析服务器)----a:Ip地址
# http默认端口为80(范围0 - 65535)标识计算机设备中的运行中的程序
# htpps默认端口为443
# http协议作用就是统一客户端和服务端之间的数据传输的规则(度量衡)

# 网络模型
